tests/opentestman/spec/R1.5-1/t1/expected-output.txt

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><s:Header><wsa:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To><wsa:Action>http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</wsa:Action><wsa:RelatesTo>uuid:5cfa6ac0-225f-125f-8002-1299d23f1200</wsa:RelatesTo><wsa:MessageID>uuid:3d6c755c-2260-1260-800a-1299d23f1200</wsa:MessageID></s:Header><s:Body><p:OpenWBEM_UnitaryComputerSystem xmlns:p="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/OpenWBEM_UnitaryComputerSystem" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><p:LastLoadInfo xsi:nil="true"/><p:PowerManagementSupported xsi:nil="true"/><p:PowerState xsi:nil="true"/><p:WakeUpType xsi:nil="true"/><p:NameFormat>IP</p:NameFormat><p:Dedicated xsi:nil="true"/><p:ResetCapability>2</p:ResetCapability><p:CreationClassName>OpenWBEM_UnitaryComputerSystem</p:CreationClassName><p:Name>pluto.us.dell.com</p:Name><p:PrimaryOwnerName xsi:nil="true"/><p:PrimaryOwnerContact xsi:nil="true"/><p:EnabledState>5</p:EnabledState><p:OtherEnabledState xsi:nil="true"/><p:RequestedState>5</p:RequestedState><p:EnabledDefault>2</p:EnabledDefault><p:TimeOfLastStateChange xsi:nil="true"/><p:InstallDate xsi:nil="true"/><p:Status xsi:nil="true"/><p:Caption xsi:nil="true"/><p:Description xsi:nil="true"/><p:ElementName xsi:nil="true"/></p:OpenWBEM_UnitaryComputerSystem></s:Body></s:Envelope>

